<!DOCTYPE html>
<html lang="en">

<head>

  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="description" content="">
  <meta name="author" content="">

  <title>¿Qué es un SGBD?</title>

  <!-- Bootstrap Core CSS -->
  <link href="css/bootstrap.min.css" rel="stylesheet">

  <!-- Custom CSS -->
  <link href="css/stylesheet.css" rel="stylesheet">

  <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
  <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
  <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

</head>

<body>

  <!-- Navigation -->
  <nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
      <!-- Brand and toggle get grouped for better mobile display -->
      <div class="navbar-header">
        <a href="#" class="navbar-left"><img src="img/logoUNAD.png" style="height: 50px;" /></a>
        <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                    <span class="sr-only">Toggle navigation</span>
                    <span class="icon-bar"></span>
                    <span class="icon-bar"></span>
                    <span class="icon-bar"></span>
                </button>
        <a class="navbar-brand" href="#"></a>
      </div>
      <!-- Collect the nav links, forms, and other content for toggling -->
      <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
        <ul class="nav navbar-nav">
          <li>
            <a href="index.html">Inicio</a>
          </li>
          <li>
            <a href="lecturas.html">Lecturas</a>
          </li>
          <li>
            <a href="videos.html">Videos</a>
          </li>
          <li>
            <a href="ejercicios.html">Ejercicios</a>
          </li>
          <li>
            <a href="autores.html">Autores</a>
          </li>
        </ul>
      </div>
      <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
  </nav>

  <!-- Page Content -->
  <div class="container">

    <div class="row" style="background-color: #dba86a">
      <img class="img-responsive" src="img/banner-que-es-sgbd.svg" style="max-height: 100px; margin: auto; width: 100%;" alt="" />
    </div>

    <!-- Page Heading -->
    <div class="row">
      <div class="col-lg-12">
        <h1 class="page-header">¿Qué es un SGBD?
        </h1>
      </div>
    </div>
    <!-- /.row -->

    <!-- Lecturas -->
    <div class="row">
      <p>
        Ramos, Ramos, & Montero (2006) definen un sistema de gestión de bases de datos de la siguiente forma:
      </p>
      <p style="padding-left: 40px;">
        Definimos un Sistema Gestor de Bases de Datos o SGBD, también llamado DBMS (Data Base Management System) como una colección de datos relacionados entre sí, estructurados y organizados, y un conjunto de programas que acceden y gestionan esos datos. La
        colección de esos datos se denomina Base de Datos o BD, (DB Data Base). (p.7)
      </p>
      <p>Un Sistema Gestor de Bases de Datos (SGBD)<span>&nbsp;es una colecci&oacute;n de programas cuyo objetivo es servir de interfaz entre la base de datos, el usuario y las aplicaciones. Se compone de un lenguaje de definici&oacute;n de datos, de un lenguaje de manipulaci&oacute;n de datos y de un lenguaje de consulta. Un SGBD permiten definir los datos a distintos niveles de abstracci&oacute;n y manipular dichos datos, garantizando la seguridad e integridad de los mismos.</span></p>

      <p><span>Algunos ejemplos de SGBD son Oracle, DB2, PostgreSQL, MySQL, MS SQL Server, etc.</span></p>
      <p><span>Un SGBD debe permitir:</span></p>
      <p><span>&bull; Definir una base de datos: especificar tipos, estructuras y restricciones de datos.</span></p>
      <p><span>&bull; Construir la base de datos: guardar los datos en alg&uacute;n medio controlado por el mismo SGBD</span></p>
      <p><span>&bull; Manipular la base de datos: realizar consultas, actualizarla, generar informes.</span></p>
      <p><span>Las caracter&iacute;sticas de un Sistema Gestor de Base de Datos SGBD son:</span></p>
      <p><span>&bull; </span><span>Abstracci&oacute;n de la informaci&oacute;n.</span><span>&nbsp;Los SGBD ahorran a los usuarios detalles acerca del almacenamiento f&iacute;sico de los datos. Da lo mismo si una base de datos ocupa uno o cientos de archivos, este hecho se hace transparente al usuario. As&iacute;, se definen varios niveles de abstracci&oacute;n.</span></p>
      <p><span>&bull; </span><span>Independencia.</span><span>&nbsp;La independencia de los datos consiste en la capacidad de modificar el esquema (f&iacute;sico o l&oacute;gico) de una base de datos sin tener que realizar cambios en las aplicaciones que se sirven de ella.</span></p>
      <p><span>&bull; </span><span>Redundancia m&iacute;nima.</span><span>&nbsp;Un buen dise&ntilde;o de una base de datos lograr&aacute; evitar la aparici&oacute;n de informaci&oacute;n repetida o redundante. De entrada, lo ideal es lograr una redundancia nula; no obstante, en algunos casos la complejidad de los c&aacute;lculos hace necesaria la aparici&oacute;n de redundancias.</span></p>
      <p><span>&bull; </span><span>Consistencia.</span><span>&nbsp;En aquellos casos en los que no se ha logrado esta redundancia nula, ser&aacute; necesario vigilar que aquella informaci&oacute;n que aparece repetida se actualice de forma coherente, es decir, que todos los datos repetidos se actualicen de forma simult&aacute;nea.</span></p>
      <p><span>&bull; </span><span>Seguridad.</span><span>&nbsp;La informaci&oacute;n almacenada en una base de datos puede llegar a tener un gran valor. Los SGBD deben garantizar que esta informaci&oacute;n se encuentra segurizada frente a usuarios malintencionados, que intenten leer informaci&oacute;n privilegiada; frente a ataques que deseen manipular o destruir la informaci&oacute;n; o simplemente ante las torpezas de alg&uacute;n usuario autorizado pero despistado. Normalmente, los SGBD disponen de un complejo sistema de permisos a usuarios y grupos de usuarios, que permiten otorgar diversas categor&iacute;as de permisos.</span></p>
      <p><span>&bull; </span><span>Integridad.</span><span>&nbsp;Se trata de adoptar las medidas necesarias para garantizar la validez de los datos almacenados. Es decir, se trata de proteger los datos ante fallos de hardware, datos introducidos por usuarios descuidados, o cualquier otra circunstancia capaz de corromper la informaci&oacute;n almacenada.</span></p>
      <p><span>&bull; </span><span>Respaldo y recuperaci&oacute;n.</span><span>&nbsp;Los SGBD deben proporcionar una forma eficiente de realizar copias de respaldo de la informaci&oacute;n almacenada en ellos, y de restaurar a partir de estas copias los datos que se hayan podido perder.</span></p>
      <p><span>&bull; </span><span>Control de la concurrencia.</span><span>&nbsp;En la mayor&iacute;a de entornos (excepto quiz&aacute;s el dom&eacute;stico), lo m&aacute;s habitual es que sean muchas las personas que acceden a una base de datos, bien para recuperar informaci&oacute;n, bien para almacenarla. Y es tambi&eacute;n frecuente que dichos accesos se realicen de forma simult&aacute;nea. As&iacute; pues, un SGBD debe controlar este acceso concurrente a la informaci&oacute;n, que podr&iacute;a derivar en inconsistencias.</span></p>
    </div>
    <!-- /.row -->

    <div class="row">
      <h3>Trabajos citados</h3>
      <span>
            Ramos, M. J., Ramos, A., & Montero, F. (2006). Sistemas gestores
            e bases de datos. Mc Graw Hill.
          </span>
    </div>

    <hr>

    <!-- Footer -->
    <footer>
      <div class="row">
        <div class="col-lg-12">
          <p><a href="autores.html">Grupo 301122_58</a>, UNAD, 2017</p>
        </div>
      </div>
      <!-- /.row -->
    </footer>
  </div>
</body>

</html>
